CAN-D/CAN-D/CAN-D/Drivers/BSP/Inc/stm32302c_custom_sd.h
/**
  ******************************************************************************
  * @file    stm32302c_custom_sd.h
  * @author  Mark Griffith
  * @brief   This file contains the common defines and functions prototypes for
  *          the stm32302c_custom_sd.c driver.
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32302C_CUSTOM_SD_H
#define __STM32302C_CUSTOM_SD_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32302c_custom.h"

#define SD_MAX_TRY 100

/** 
  * @brief  SD status structure definition  
  */
#define MSD_OK 0x00
#define MSD_ERROR 0x01

typedef enum {
    /**
  * @brief  SD reponses and error flags
  */
    SD_RESPONSE_NO_ERROR = (0x00),
    SD_IN_IDLE_STATE = (0x01),
    SD_ERASE_RESET = (0x02),
    SD_ILLEGAL_COMMAND = (0x04),
    SD_COM_CRC_ERROR = (0x08),
    SD_ERASE_SEQUENCE_ERROR = (0x10),
    SD_ADDRESS_ERROR = (0x20),
    SD_PARAMETER_ERROR = (0x40),
    SD_RESPONSE_FAILURE = (0xFF),

    /* R1 answer value */
    SD_R1_NO_ERROR = (0x00),
    SD_R1_IN_IDLE_STATE = (0x01),
    SD_R1_ERASE_RESET = (0x02),
    SD_R1_ILLEGAL_COMMAND = (0x04),
    SD_R1_COM_CRC_ERROR = (0x08),
    SD_R1_ERASE_SEQUENCE_ERROR = (0x10),
    SD_R1_ADDRESS_ERROR = (0x20),
    SD_R1_PARAMETER_ERROR = (0x40),

    /* R2 answer value */
    SD_R2_NO_ERROR = 0x00,
    SD_R2_CARD_LOCKED = 0x01,
    SD_R2_LOCKUNLOCK_ERROR = 0x02,
    SD_R2_ERROR = 0x04,
    SD_R2_CC_ERROR = 0x08,
    SD_R2_CARD_ECC_FAILED = 0x10,
    SD_R2_WP_VIOLATION = 0x20,
    SD_R2_ERASE_PARAM = 0x40,
    SD_R2_OUTOFRANGE = 0x80,

    /**
  * @brief  Data response error
  */
    SD_DATA_OK = (0x05),
    SD_DATA_CRC_ERROR = (0x0B),
    SD_DATA_WRITE_ERROR = (0x0D),
    SD_DATA_OTHER_ERROR = (0xFF)
} SD_Info;

/**
  * @brief  SD ansewer format
  */
typedef enum {
    SD_RESPONSE_R1_EXPECTED,
    SD_RESPONSE_R1B_EXPECTED,
    SD_RESPONSE_R2_EXPECTED,
    SD_RESPONSE_R3_EXPECTED,
    SD_RESPONSE_R4R5_EXPECTED,
    SD_RESPONSE_R7_EXPECTED,
} SD_RESPONSE_type;

typedef struct {
    uint8_t r1;
    uint8_t r2;
    uint8_t r3;
    uint8_t r4;
    uint8_t r5;
} SD_CmdTypeDef;

/** 
  * @brief  Card Specific Data: CSD Register
  */
typedef struct
{
    __IO uint8_t CSDStruct; /* CSD structure */
    __IO uint8_t SysSpecVersion; /* System specification version */
    __IO uint8_t Reserved1; /* Reserved */
    __IO uint8_t TAAC; /* Data read access-time 1 */
    __IO uint8_t NSAC; /* Data read access-time 2 in CLK cycles */
    __IO uint8_t MaxBusClkFrec; /* Max. bus clock frequency */
    __IO uint16_t CardComdClasses; /* Card command classes */
    __IO uint8_t RdBlockLen; /* Max. read data block length */
    __IO uint8_t PartBlockRead; /* Partial blocks for read allowed */
    __IO uint8_t WrBlockMisalign; /* Write block misalignment */
    __IO uint8_t RdBlockMisalign; /* Read block misalignment */
    __IO uint8_t DSRImpl; /* DSR implemented */
    __IO uint8_t Reserved2; /* Reserved */
    __IO uint32_t DeviceSize; /* Device Size */
    __IO uint8_t MaxRdCurrentVDDMin; /* Max. read current @ VDD min */
    __IO uint8_t MaxRdCurrentVDDMax; /* Max. read current @ VDD max */
    __IO uint8_t MaxWrCurrentVDDMin; /* Max. write current @ VDD min */
    __IO uint8_t MaxWrCurrentVDDMax; /* Max. write current @ VDD max */
    __IO uint8_t DeviceSizeMul; /* Device size multiplier */
    __IO uint8_t EraseGrSize; /* Erase group size */
    __IO uint8_t EraseGrMul; /* Erase group size multiplier */
    __IO uint8_t WrProtectGrSize; /* Write protect group size */
    __IO uint8_t WrProtectGrEnable; /* Write protect group enable */
    __IO uint8_t ManDeflECC; /* Manufacturer default ECC */
    __IO uint8_t WrSpeedFact; /* Write speed factor */
    __IO uint8_t MaxWrBlockLen; /* Max. write data block length */
    __IO uint8_t WriteBlockPaPartial; /* Partial blocks for write allowed */
    __IO uint8_t Reserved3; /* Reserded */
    __IO uint8_t ContentProtectAppli; /* Content protection application */
    __IO uint8_t FileFormatGrouop; /* File format group */
    __IO uint8_t CopyFlag; /* Copy flag (OTP) */
    __IO uint8_t PermWrProtect; /* Permanent write protection */
    __IO uint8_t TempWrProtect; /* Temporary write protection */
    __IO uint8_t FileFormat; /* File Format */
    __IO uint8_t ECC; /* ECC code */
    __IO uint8_t CSD_CRC; /* CSD CRC */
    __IO uint8_t Reserved4; /* always 1*/
} SD_CSD;

/** 
  * @brief  Card Identification Data: CID Register   
  */
typedef struct
{
    __IO uint8_t ManufacturerID; /* ManufacturerID */
    __IO uint16_t OEM_AppliID; /* OEM/Application ID */
    __IO uint32_t ProdName1; /* Product Name part1 */
    __IO uint8_t ProdName2; /* Product Name part2*/
    __IO uint8_t ProdRev; /* Product Revision */
    __IO uint32_t ProdSN; /* Product Serial Number */
    __IO uint8_t Reserved1; /* Reserved1 */
    __IO uint16_t ManufactDate; /* Manufacturing Date */
    __IO uint8_t CID_CRC; /* CID CRC */
    __IO uint8_t Reserved2; /* always 1 */
} SD_CID;

/** 
  * @brief SD Card information 
  */
typedef struct
{
    SD_CSD Csd;
    SD_CID Cid;
    uint32_t CardCapacity; /* Card Capacity */
    uint32_t CardBlockSize; /* Card Block Size */
} SD_CardInfo;

/**
  * @brief  Start Data tokens:
  *         Tokens (necessary because at nop/idle (and CS active) only 0xff is 
  *         on the data/command line)  
  */
#define SD_START_DATA_SINGLE_BLOCK_READ 0xFE /* Data token start byte, Start Single Block Read */
#define SD_START_DATA_MULTIPLE_BLOCK_READ 0xFE /* Data token start byte, Start Multiple Block Read */
#define SD_START_DATA_SINGLE_BLOCK_WRITE 0xFE /* Data token start byte, Start Single Block Write */
#define SD_START_DATA_MULTIPLE_BLOCK_WRITE 0xFD /* Data token start byte, Start Multiple Block Write */
#define SD_STOP_DATA_MULTIPLE_BLOCK_WRITE 0xFD /* Data toke stop byte, Stop Multiple Block Write */

/**
  * @brief  SD detection on its memory slot
  */
#define SD_PRESENT ((uint8_t)0x01)
#define SD_NOT_PRESENT ((uint8_t)0x00)

/**
  * @brief  Commands: CMDxx = CMD-number | 0x40
  */
#define SD_CMD_GO_IDLE_STATE 0 /* CMD0 = 0x40 */
#define SD_CMD_SEND_OP_COND 1 /* CMD1 = 0x41 */
#define SD_CMD_SEND_IF_COND 8 /* CMD8 = 0x48  */
#define SD_CMD_SEND_CSD 9 /* CMD9 = 0x49 */
#define SD_CMD_SEND_CID 10 /* CMD10 = 0x4A */
#define SD_CMD_STOP_TRANSMISSION 12 /* CMD12 = 0x4C */
#define SD_CMD_SEND_STATUS 13 /* CMD13 = 0x4D */
#define SD_CMD_SET_BLOCKLEN 16 /* CMD16 = 0x50 */
#define SD_CMD_READ_SINGLE_BLOCK 17 /* CMD17 = 0x51 */
#define SD_CMD_READ_MULT_BLOCK 18 /* CMD18 = 0x52 */
#define SD_CMD_SET_BLOCK_COUNT 23 /* CMD23 = 0x57 */
#define SD_CMD_WRITE_SINGLE_BLOCK 24 /* CMD24 = 0x58 */
#define SD_CMD_WRITE_MULT_BLOCK 25 /* CMD25 = 0x59 */
#define SD_CMD_PROG_CSD 27 /* CMD27 = 0x5B */
#define SD_CMD_SET_WRITE_PROT 28 /* CMD28 = 0x5C */
#define SD_CMD_CLR_WRITE_PROT 29 /* CMD29 = 0x5D */
#define SD_CMD_SEND_WRITE_PROT 30 /* CMD30 = 0x5E */
#define SD_CMD_SD_ERASE_GRP_START 32 /* CMD32 = 0x60 */
#define SD_CMD_SD_ERASE_GRP_END 33 /* CMD33 = 0x61 */
#define SD_CMD_UNTAG_SECTOR 34 /* CMD34 = 0x62 */
#define SD_CMD_ERASE_GRP_START 35 /* CMD35 = 0x63 */
#define SD_CMD_ERASE_GRP_END 36 /* CMD36 = 0x64 */
#define SD_CMD_UNTAG_ERASE_GROUP 37 /* CMD37 = 0x65 */
#define SD_CMD_ERASE 38 /* CMD38 = 0x66 */
#define SD_CMD_SD_APP_OP_COND 41 /* CMD41 = 0x69 */
#define SD_CMD_APP_CMD 55 /* CMD55 = 0x77 */
#define SD_CMD_READ_OCR 58 /* CMD55 = 0x79 */

uint8_t BSP_SD_Init(void);
uint8_t BSP_SD_IsDetected(void);
uint8_t BSP_SD_ReadBlocks(uint32_t* p32Data, uint64_t ReadAddr, uint16_t BlockSize, uint32_t NumberOfBlocks);
uint8_t BSP_SD_WriteBlocks(uint32_t* p32Data, uint64_t WriteAddr, uint16_t BlockSize, uint32_t NumberOfBlocks);
uint8_t BSP_SD_Erase(uint32_t StartAddr, uint32_t EndAddr);
uint8_t BSP_SD_GetStatus(void);
uint8_t BSP_SD_GetCardInfo(SD_CardInfo* pCardInfo);

/* Link functions for SD Card peripheral */
void SD_IO_Init(void);
void SD_IO_WriteByte(uint8_t Data);
uint8_t SD_IO_ReadByte(void);
HAL_StatusTypeDef SD_IO_WriteCmdLegacy(uint8_t Cmd, uint32_t Arg, uint8_t Crc, uint8_t Response);
SD_CmdTypeDef SD_IO_WriteCmd(uint8_t Cmd, uint32_t Arg, uint8_t Crc, uint8_t Response);
HAL_StatusTypeDef SD_IO_WaitResponse(uint8_t Response);
void SD_IO_WriteDummy(void);

#ifdef __cplusplus
}
#endif

#endif /* __H */
